stm32-hotspot/STM32WB55_BLE_HeartRate_Client/STM32_WPAN/App/hr_client_app.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file    hr_client_app.c
  * @author  MCD Application Team
  * @brief   Heart Rate Client Application
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2019-2021 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/

#include "main.h"
#include "app_common.h"

#include "dbg_trace.h"

#include "ble.h"
#include "hr_client_app.h"

#include "stm32_seq.h"
#include "app_ble.h"

/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/

typedef enum
{
  HEART_RATE_MEASUREMENT_INFO_RECEIVED_EVT,
} HeartRate_Client_Opcode_Notification_evt_t;

typedef struct
{
  uint8_t * pPayload;
  uint8_t     Length;
} HeartRate_Client_Data_t;

typedef struct
{
  HeartRate_Client_Opcode_Notification_evt_t  HeartRate_Client_Evt_Opcode;
  HeartRate_Client_Data_t DataTransfered;
} HeartRate_Client_App_Notification_evt_t;

typedef struct
{
  /**
   * state of the HeartRate Client
   * state machine
   */
  APP_BLE_ConnStatus_t state;

  /**
   * connection handle
   */
  uint16_t connHandle;

  /**
   * handle of the HeartRate service
   */
  uint16_t HeartRateServiceHandle;

  /**
   * end handle of the HeartRate service
   */
  uint16_t HeartRateServiceEndHandle;

  /**
   * handle of the Heart Rate Measurement characteristic
   */
  uint16_t HeartRateMeasurementCharHdle;

  /**
   * handle of the client configuration
   * descriptor of Tx characteristic
   */
  uint16_t HeartRateMeasurementDescHandle;

  /**
   * handle of the Body Sensor Location characteristic
   */
  uint16_t BodySensorLocationCharHdle;

  /**
   * handle of the Heart Rate Control Point characteristic
   */
  uint16_t HeartRateControlPointCharHdle;

}HeartRate_ClientContext_t;

/* USER CODE BEGIN PTD */
typedef struct{
  uint8_t                          Write;
  uint16_t                         Notify;
} HeartRate_ButtonCharValue_t;

typedef struct
{
  uint8_t                          Notification_Status; /* used to check if HeartRate Server is enabled to Notify */
  HeartRate_ButtonCharValue_t      ButtonStatus;
  uint16_t                         ConnectionHandle; 
} HeartRate_Client_App_Context_t;

/* USER CODE END PTD */

/* Private defines ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macros -------------------------------------------------------------*/
#define UNPACK_2_BYTE_PARAMETER(ptr)  \
        (uint16_t)((uint16_t)(*((uint8_t *)ptr))) |   \
        (uint16_t)((((uint16_t)(*((uint8_t *)ptr + 1))) << 8))
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
/**
 * START of Section BLE_APP_CONTEXT
 */

static HeartRate_ClientContext_t aHeartRateClientContext[BLE_CFG_CLT_MAX_NBR_CB];

/**
 * END of Section BLE_APP_CONTEXT
 */
/* USER CODE BEGIN PV */
static HeartRate_Client_App_Context_t HeartRate_Client_App_Context;
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
static void Gatt_Notification(HeartRate_Client_App_Notification_evt_t *pNotification);
static SVCCTL_EvtAckStatus_t Event_Handler(void *Event);
/* USER CODE BEGIN PFP */
static tBleStatus Write_Char(uint16_t UUID, uint8_t Service_Instance, uint8_t *pPayload);
static tBleStatus Read_Char(uint16_t UUID, uint8_t Service_Instance);
static tBleStatus Toggle_Notify_Char(uint16_t UUID, uint8_t Service_Instance, uint8_t *pPayload);
static void Button1_Trigger_Received( void );
static void Button2_Trigger_Received( void );
static void Button3_Trigger_Received( void );
static void Update_Service( void );
/* USER CODE END PFP */

/* Functions Definition ------------------------------------------------------*/
/**
 * @brief  Service initialization
 * @param  None
 * @retval None
 */
void HRC_APP_Init(void)
{
  uint8_t index =0;
/* USER CODE BEGIN HRC_APP_Init_1 */
  UTIL_SEQ_RegTask( 1<< CFG_TASK_SEARCH_SERVICE_ID, UTIL_SEQ_RFU, Update_Service );
  UTIL_SEQ_RegTask( 1<< CFG_TASK_SW1_BUTTON_PUSHED_ID, UTIL_SEQ_RFU, Button1_Trigger_Received );
  UTIL_SEQ_RegTask( 1<< CFG_TASK_SW2_BUTTON_PUSHED_ID, UTIL_SEQ_RFU, Button2_Trigger_Received );
  UTIL_SEQ_RegTask( 1<< CFG_TASK_SW3_BUTTON_PUSHED_ID, UTIL_SEQ_RFU, Button3_Trigger_Received );

  /**
   * Initialize LedButton Service
   */
  HeartRate_Client_App_Context.Notification_Status = 0;
  HeartRate_Client_App_Context.ConnectionHandle = 0x00;

  HeartRate_Client_App_Context.ButtonStatus.Write = 0x00;
  HeartRate_Client_App_Context.ButtonStatus.Notify = 0x0000;
/* USER CODE END HRC_APP_Init_1 */
  for(index = 0; index < BLE_CFG_CLT_MAX_NBR_CB; index++)
  {
    aHeartRateClientContext[index].state = APP_BLE_IDLE;
  }

  /**
   *  Register the event handler to the BLE controller
   */
  SVCCTL_RegisterCltHandler(Event_Handler);

#if(CFG_DEBUG_APP_TRACE != 0)
  APP_DBG_MSG("-- HEARTRATE CLIENT INITIALIZED \n");
#endif

/* USER CODE BEGIN HRC_APP_Init_2 */

/* USER CODE END HRC_APP_Init_2 */
  return;
}

void HRC_APP_Notification(HRC_APP_ConnHandle_Not_evt_t *pNotification)
{
/* USER CODE BEGIN HRC_APP_Notification_1 */

/* USER CODE END HRC_APP_Notification_1 */
  switch(pNotification->HR_Evt_Opcode)
  {
/* USER CODE BEGIN HR_Evt_Opcode */

/* USER CODE END HR_Evt_Opcode */

  case HR_CONN_HANDLE_EVT :
/* USER CODE BEGIN HR_CONN_HANDLE_EVT */
    HeartRate_Client_App_Context.ConnectionHandle = pNotification->ConnectionHandle;
/* USER CODE END HR_CONN_HANDLE_EVT */
      break;

    case HR_DISCON_HANDLE_EVT :
/* USER CODE BEGIN HR_DISCON_HANDLE_EVT */
      {
      uint8_t index = 0;
      HeartRate_Client_App_Context.ConnectionHandle = 0x00;
      while((index < BLE_CFG_CLT_MAX_NBR_CB) &&
                  (aHeartRateClientContext[index].state != APP_BLE_IDLE))
      {
        aHeartRateClientContext[index].state = APP_BLE_IDLE;
      }
      BSP_LED_Off(LED_BLUE); 
      }
/* USER CODE END HR_DISCON_HANDLE_EVT */
      break;

    default:
/* USER CODE BEGIN HR_Evt_Opcode_Default */

/* USER CODE END HR_Evt_Opcode_Default */
      break;
  }
/* USER CODE BEGIN HRC_APP_Notification_2 */

/* USER CODE END HRC_APP_Notification_2 */
  return;
}
/* USER CODE BEGIN FD */
void HRC_APP_SW1_Button_Action(void)
{
  UTIL_SEQ_SetTask(1<<CFG_TASK_SW1_BUTTON_PUSHED_ID, CFG_SCH_PRIO_0);
}

void HRC_APP_SW2_Button_Action(void)
{
  UTIL_SEQ_SetTask(1<<CFG_TASK_SW2_BUTTON_PUSHED_ID, CFG_SCH_PRIO_0);
}

void HRC_APP_SW3_Button_Action(void)
{
  UTIL_SEQ_SetTask(1<<CFG_TASK_SW3_BUTTON_PUSHED_ID, CFG_SCH_PRIO_0);
}
/* USER CODE END FD */

