stm32-hotspot/STM32WB55_BLE_HeartRate_Client/STM32_WPAN/App/hr_client_app.c
          /*
           * event data will be of the format
           * 2 bytes handle
           * 2 bytes UUID
           */

          uint8_t index;

          index = 0;
          while((index < BLE_CFG_CLT_MAX_NBR_CB) &&
                  (aHeartRateClientContext[index].connHandle != pr->Connection_Handle))

            index++;

          if(index < BLE_CFG_CLT_MAX_NBR_CB)
          {

            numDesc = (pr->Event_Data_Length) / 4;
            /* we are interested only in 16 bit UUIDs */
            idx = 0;
            if (pr->Format == UUID_TYPE_16)
            {
              for (i=0; i<numDesc; i++)
              {
                handle = UNPACK_2_BYTE_PARAMETER(&pr->Handle_UUID_Pair[idx]);
                uuid = UNPACK_2_BYTE_PARAMETER(&pr->Handle_UUID_Pair[idx+2]);

                if(uuid == CLIENT_CHARACTERISTIC_CONFIG_DESCRIPTOR_UUID)
                {
#if(CFG_DEBUG_APP_TRACE != 0)
                  APP_DBG_MSG("-- GATT : CLIENT_CHARACTERISTIC_CONFIG_DESCRIPTOR_UUID - connection handle 0x%x\n", aHeartRateClientContext[index].connHandle);
#endif
                  if( aHeartRateClientContext[index].state == APP_BLE_DISCOVER_NOTIFICATION_CHAR_DESC)
                  {
                    aHeartRateClientContext[index].HeartRateMeasurementDescHandle = handle;
                    aHeartRateClientContext[index].state = APP_BLE_ENABLE_NOTIFICATION_DESC;
                  }
                }
                idx += 4;
              }
            }
          }
        }
        break; /*ACI_ATT_FIND_INFO_RESP_VSEVT_CODE*/

        case ACI_GATT_NOTIFICATION_VSEVT_CODE:
        {
          aci_gatt_notification_event_rp0 *pr = (void*)blecore_evt->data;
          uint8_t index;

          index = 0;
          while((index < BLE_CFG_CLT_MAX_NBR_CB) &&
                  (aHeartRateClientContext[index].connHandle != pr->Connection_Handle))
            index++;

          if(index < BLE_CFG_CLT_MAX_NBR_CB)
          {

            if (pr->Attribute_Handle == aHeartRateClientContext[index].HeartRateMeasurementCharHdle)
            {

              Notification.HeartRate_Client_Evt_Opcode = HEART_RATE_MEASUREMENT_INFO_RECEIVED_EVT;
              Notification.DataTransfered.Length = pr->Attribute_Value_Length;
              Notification.DataTransfered.pPayload = &pr->Attribute_Value[0];

              Gatt_Notification(&Notification);

              /* INFORM APPLICATION BUTTON IS PUSHED BY END DEVICE */

            }
          }
        }
        break;/* end ACI_GATT_NOTIFICATION_VSEVT_CODE */

        case ACI_GATT_PROC_COMPLETE_VSEVT_CODE:
        {
          aci_gatt_proc_complete_event_rp0 *pr = (void*)blecore_evt->data;
#if(CFG_DEBUG_APP_TRACE != 0)
          APP_DBG_MSG("-- GATT : ACI_GATT_PROC_COMPLETE_VSEVT_CODE \n");
          APP_DBG_MSG("\n");
#endif

          uint8_t index;

          index = 0;
          while((index < BLE_CFG_CLT_MAX_NBR_CB) &&
                  (aHeartRateClientContext[index].connHandle != pr->Connection_Handle))
            index++;

          if(index < BLE_CFG_CLT_MAX_NBR_CB)
          {

            UTIL_SEQ_SetTask( 1<<CFG_TASK_SEARCH_SERVICE_ID, CFG_SCH_PRIO_0);

          }
        }
        break; /*ACI_GATT_PROC_COMPLETE_VSEVT_CODE*/
        
        case ACI_ATT_READ_RESP_VSEVT_CODE:
        {
          aci_att_read_resp_event_rp0 *pr = (void*)blecore_evt->data;
          
          uint8_t index;

          index = 0;
          while((index < BLE_CFG_CLT_MAX_NBR_CB) &&
                  (aHeartRateClientContext[index].connHandle != pr->Connection_Handle))
            index++;
          
#if(CFG_DEBUG_APP_TRACE != 0)
          APP_DBG_MSG("-- ATT : ACI_ATT_READ_RESP_VSEVT_CODE - connection handle 0x%x - ", aHeartRateClientContext[index].connHandle);
          APP_DBG_MSG("Length: %02d, Data: ", pr->Event_Data_Length);
          for (int i = 0; i < pr->Event_Data_Length; i++)
          {
            APP_DBG_MSG("%02X ", pr->Attribute_Value[i]);
          }
          APP_DBG_MSG(" \n\n\r");
#endif
          
        }
        break; /*ACI_ATT_READ_RESP_VSEVT_CODE*/
        
        default:
          break;
      }
    }

    break; /* HCI_VENDOR_SPECIFIC_DEBUG_EVT_CODE */

    default:
      break;
  }

  return(return_value);
}/* end BLE_CTRL_Event_Acknowledged_Status_t */

void Gatt_Notification(HeartRate_Client_App_Notification_evt_t *pNotification)
{
/* USER CODE BEGIN Gatt_Notification_1*/

/* USER CODE END Gatt_Notification_1 */
  switch(pNotification->HeartRate_Client_Evt_Opcode)
  {
/* USER CODE BEGIN HeartRate_Client_Evt_Opcode */

/* USER CODE END HeartRate_Client_Evt_Opcode */

    case HEART_RATE_MEASUREMENT_INFO_RECEIVED_EVT:
/* USER CODE BEGIN HEART_RATE_MEASUREMENT_INFO_RECEIVED_EVT */
    {
      APP_DBG_MSG("-- HEART RATE APPLICATION CLIENT : NOTIFICATION RECEIVED - ");
      for (int i = 0; i < pNotification->DataTransfered.Length; i++)
      {
        APP_DBG_MSG("%02X ", pNotification->DataTransfered.pPayload[i]);
      }
      APP_DBG_MSG("\n\r");
    }
/* USER CODE END HEART_RATE_MEASUREMENT_INFO_RECEIVED_EVT */
      break;

    default:
/* USER CODE BEGIN HeartRate_Client_Evt_Opcode_Default */

/* USER CODE END HeartRate_Client_Evt_Opcode_Default */
      break;
  }
/* USER CODE BEGIN Gatt_Notification_2*/

/* USER CODE END Gatt_Notification_2 */
  return;
}

uint8_t HeartRate_Client_APP_Get_State( void ) {
  return aHeartRateClientContext[0].state;
}
/* USER CODE BEGIN LF */
tBleStatus Write_Char(uint16_t UUID, uint8_t Service_Instance, uint8_t *pPayload)
{
  tBleStatus ret = BLE_STATUS_INVALID_PARAMS;
  uint8_t index;

  index = 0;
  while((index < BLE_CFG_CLT_MAX_NBR_CB) &&
          (aHeartRateClientContext[index].state != APP_BLE_IDLE))
  {
    switch(UUID)
    {
      case CONTROL_POINT_UUID:
        ret = aci_gatt_write_without_resp(aHeartRateClientContext[index].connHandle,
                                         aHeartRateClientContext[index].HeartRateControlPointCharHdle,
                                         2, /* charValueLen */
                                         (uint8_t *)  pPayload);
        break;
      default:
        break;
    }
    index++;
  }

  return ret;
}/* end Write_Char() */

