stm32-hotspot/STM32WB55_BLE_HeartRate_Client/STM32_WPAN/App/hr_client_app.c
tBleStatus Read_Char(uint16_t UUID, uint8_t Service_Instance)
{
  tBleStatus ret = BLE_STATUS_INVALID_PARAMS;
  uint8_t index;

  index = 0;
  while((index < BLE_CFG_CLT_MAX_NBR_CB) &&
          (aHeartRateClientContext[index].state != APP_BLE_IDLE))
  {
    switch(UUID)
    {
      case SENSOR_LOCATION_UUID:        
        ret = aci_gatt_read_char_value(aHeartRateClientContext[index].connHandle,
                                      aHeartRateClientContext[index].BodySensorLocationCharHdle);
        break;
      default:
        break;
    }
    index++;
  }

  return ret;
}/* end Read_Char() */

tBleStatus Toggle_Notify_Char(uint16_t UUID, uint8_t Service_Instance, uint8_t *pPayload)
{
  tBleStatus ret = BLE_STATUS_INVALID_PARAMS;
  uint8_t index;

  index = 0;
  while((index < BLE_CFG_CLT_MAX_NBR_CB) &&
          (aHeartRateClientContext[index].state != APP_BLE_IDLE))
  {
    switch(UUID)
    {
      case HEART_RATE_MEASURMENT_UUID:        
        ret = aci_gatt_write_char_desc(aHeartRateClientContext[index].connHandle,
                                      aHeartRateClientContext[index].HeartRateMeasurementDescHandle,
                                      2, /* descValueLen */
                                      (uint8_t *) pPayload);
        break;
      default:
        break;
    }
    index++;
  }

  return ret;
}/* end Toggle_Notify_Char() */

void Button1_Trigger_Received(void)
{
  if(HeartRate_Client_App_Context.ButtonStatus.Write == 0x00)
  {
    HeartRate_Client_App_Context.ButtonStatus.Write = 0x01;
  }
  else 
  {
    HeartRate_Client_App_Context.ButtonStatus.Write = 0x00;
  }
  
  APP_DBG_MSG("-- HEART RATE APPLICATION CLIENT : BUTTON PUSHED - WRITE HEART RATE CONTROL POINT - %02X \n ", HeartRate_Client_App_Context.ButtonStatus.Write);
  APP_DBG_MSG(" \n\r");

  Write_Char( CONTROL_POINT_UUID, 0, (uint8_t *)&HeartRate_Client_App_Context.ButtonStatus);

  return;
}

void Button2_Trigger_Received(void)
{
  APP_DBG_MSG("-- HEART RATE APPLICATION CLIENT : BUTTON PUSHED - READ BODY SENSOR LOCATION \n");

  Read_Char( SENSOR_LOCATION_UUID, 0);

  return;
}

void Button3_Trigger_Received(void)
{
  if(HeartRate_Client_App_Context.ButtonStatus.Notify == 0x0000)
  {
    HeartRate_Client_App_Context.ButtonStatus.Notify = 0x0001;
    APP_DBG_MSG("-- HEART RATE APPLICATION CLIENT : BUTTON PUSHED - ENABLE HEART RATE MEASUREMENT NOTIFICATION \n ");
  }
  else 
  {
    HeartRate_Client_App_Context.ButtonStatus.Notify = 0x0000;
    APP_DBG_MSG("-- HEART RATE APPLICATION CLIENT : BUTTON PUSHED - DISABLE HEART RATE MEASUREMENT NOTIFICATION \n ");
  }
  APP_DBG_MSG(" \n\r");

  Toggle_Notify_Char( HEART_RATE_MEASURMENT_UUID, 0, (uint8_t *)&HeartRate_Client_App_Context.ButtonStatus.Notify);

  return;
}

void Update_Service()
{
  uint16_t enable = 0x0001;
  uint16_t disable = 0x0000;
  uint8_t index;

  index = 0;
  while((index < BLE_CFG_CLT_MAX_NBR_CB) &&
          (aHeartRateClientContext[index].state != APP_BLE_IDLE))
  {
    switch(aHeartRateClientContext[index].state)
    {
      case APP_BLE_DISCOVER_SERVICES:
        APP_DBG_MSG("HEARTRATE_DISCOVER_SERVICES\n");
        break;
      case APP_BLE_DISCOVER_CHARACS:
        APP_DBG_MSG("* GATT : Discover HeartRate Characteristics\n");
        aci_gatt_disc_all_char_of_service(aHeartRateClientContext[index].connHandle,
                                          aHeartRateClientContext[index].HeartRateServiceHandle,
                                          aHeartRateClientContext[index].HeartRateServiceEndHandle);
        break;
      case APP_BLE_DISCOVER_WRITE_DESC: /* Not Used - No descriptor */
        APP_DBG_MSG("* GATT : Discover Descriptor of Heart Rate Control Point Characteristic\n");
        aci_gatt_disc_all_char_desc(aHeartRateClientContext[index].connHandle,
                                    aHeartRateClientContext[index].HeartRateControlPointCharHdle,
                                    aHeartRateClientContext[index].HeartRateControlPointCharHdle+2);
        break;
      case APP_BLE_DISCOVER_NOTIFICATION_CHAR_DESC:
        APP_DBG_MSG("* GATT : Discover Descriptor of Heart Rate Measurement Characteristic\n");
        aci_gatt_disc_all_char_desc(aHeartRateClientContext[index].connHandle,
                                    aHeartRateClientContext[index].HeartRateMeasurementCharHdle,
                                    aHeartRateClientContext[index].HeartRateMeasurementCharHdle+2);
        break;
      case APP_BLE_ENABLE_NOTIFICATION_DESC:
        APP_DBG_MSG("* GATT : Enable Heart Rate Measurement Notification\n");
        aci_gatt_write_char_desc(aHeartRateClientContext[index].connHandle,
                                 aHeartRateClientContext[index].HeartRateMeasurementDescHandle,
                                 2,
                                 (uint8_t *)&enable);
        HeartRate_Client_App_Context.ButtonStatus.Notify = 0x0001;
        aHeartRateClientContext[index].state = APP_BLE_CONNECTED_CLIENT;
        BSP_LED_Off(LED_RED);
        break;
      case APP_BLE_DISABLE_NOTIFICATION_DESC :
        APP_DBG_MSG("* GATT : Disable Heart Rate Measurement Notification\n");
        aci_gatt_write_char_desc(aHeartRateClientContext[index].connHandle,
                                 aHeartRateClientContext[index].HeartRateMeasurementDescHandle,
                                 2,
                                 (uint8_t *)&disable);
        aHeartRateClientContext[index].state = APP_BLE_CONNECTED_CLIENT;
        break;
      default:
        break;
    }
    index++;
  }
  return;
}
/* USER CODE END LF */
